anachrocomputer/STM32_MCP4822/spi_oled_dac.c
    for (y = y1, i = 0; y <= y2; y++, i++) {
        row = bitmap + (stride * (i / 8));
        
        for (x = x1, j = 0; x <= x2; x++, j++)
            if (row[j] & (1 << (i % 8)))
                Frame[y][x] = fg;
            else
                Frame[y][x] = bg;
    }
}


#define  WD  (15)    // Width of digit (X-coord of rightmost pixel of segments 'b' and 'c')
#define  GY  (13)    // Y-coord of 'g' segment of Panaplex (slightly above half-way)

void drawLed(const int x0, int x, int y, const uint16_t c)
{
   x *= 4;
   y *= 4;
   
   x += x0;
   y += 3;
   
   setHline(x, x + 2, y + 0, c);
   setHline(x, x + 2, y + 1, c);
   setHline(x, x + 2, y + 2, c);
}


void drawSegA(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 0, c);
      setHline(x, x + WD, 1, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 0, c);
      drawLed(x, 2, 0, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 0, c);
      setHline(x + 3, x + WD - 3, 1, c);
      setHline(x + 3, x + WD - 3, 2, c);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 0, c);
      setHline(x + 2, x + WD - 2, 1, c);
      setHline(x + 3, x + WD - 3, 2, c);
      break;
   }
}


void drawSegB(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     0, GY, c);
      setVline(x + WD - 1, 0, GY, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 1, c);
      drawLed(x, 3, 2, c);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     3, 14, c);
      setVline(x + WD - 1, 3, 14, c);
      setVline(x + WD - 2, 3, 14, c);
      break;
   case VFD_STYLE:
      setVline(x + WD,     1, 13, c);
      setVline(x + WD - 1, 2, 14, c);
      setVline(x + WD - 2, 3, 13, c);
      break;
   }
}


void drawSegC(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     GY, 31, c);
      setVline(x + WD - 1, GY, 31, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 4, c);
      drawLed(x, 3, 5, c);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     18, 28, c);
      setVline(x + WD - 1, 18, 28, c);
      setVline(x + WD - 2, 18, 28, c);
      break;
   case VFD_STYLE:
      setVline(x + WD,     19, 30, c);
      setVline(x + WD - 1, 18, 29, c);
      setVline(x + WD - 2, 19, 28, c);
      break;
   }
}


void drawSegD(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 31, c);
      setHline(x, x + WD, 30, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 6, c);
      drawLed(x, 2, 6, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 31, c);
      setHline(x + 3, x + WD - 3, 30, c);
      setHline(x + 3, x + WD - 3, 29, c);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 31, c);
      setHline(x + 2, x + WD - 2, 30, c);
      setHline(x + 3, x + WD - 3, 29, c);
      break;
   }
}


void drawSegE(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, GY, 31, c);
      setVline(x + 1, GY, 31, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 4, c);
      drawLed(x, 0, 5, c);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 18, 28, c);
      setVline(x + 1, 18, 28, c);
      setVline(x + 2, 18, 28, c);
      break;
   case VFD_STYLE:
      setVline(x + 0, 17, 30, c);
      setVline(x + 1, 18, 29, c);
      setVline(x + 2, 19, 28, c);
      break;
   }
}


void drawSegF(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, 0, GY, c);
      setVline(x + 1, 0, GY, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 1, c);
      drawLed(x, 0, 2, c);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 3, 14, c);
      setVline(x + 1, 3, 14, c);
      setVline(x + 2, 3, 14, c);
      break;
   case VFD_STYLE:
      setVline(x + 0, 1, 15, c);
      setVline(x + 1, 2, 14, c);
      setVline(x + 2, 3, 13, c);
      break;
   }
}


void drawSegG(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, GY, c);
      setHline(x, x + WD, GY + 1, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 3, c);
      drawLed(x, 2, 3, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 15, c);
      setHline(x + 3, x + WD - 3, 16, c);
      setHline(x + 3, x + WD - 3, 17, c);
      break;
   case VFD_STYLE:
      setHline(x + 2, x + WD - 2, 15, c);
      setHline(x + 1, x + WD - 1, 16, c);
      setHline(x + 2, x + WD - 2, 17, c);
      break;
   }
}


void drawSegH(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD, x + WD + 3, GY, c);
      setHline(x + WD, x + WD + 3, GY + 1, c);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 3, c);
      break;
   case LED_BAR_STYLE:
      setHline(x + WD + 1, x + WD + 3, 15, c);
      setHline(x + WD + 1, x + WD + 3, 16, c);
      setHline(x + WD + 1, x + WD + 3, 17, c);
      break;
   case VFD_STYLE:
      setHline(x + WD,     x + WD + 3, 15, c);
      setHline(x + WD - 1, x + WD + 3, 16, c);
      setHline(x + WD,     x + WD + 3, 17, c);
      break;
   }
}


void drawSegI(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 0, c);
      break;
   }
}


void drawSegJ(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 0, c);
      break;
   }
}


void drawSegK(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 3, c);
      break;
   }
}


void drawSegL(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 6, c);
      break;
   }
}


void drawSegM(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 6, c);
      break;
   }
}


void drawSegN(const int x, const int style, const uint16_t c)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 3, c);
      break;
   }
}


