anachrocomputer/STM32_MCP4822/spi_oled_dac.c
/* initSPI --- set up the SPI interface */

static void initSPI(void)
{
   // Configure Reset and Clock Control
   RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;                    // Enable clock to SPI1 peripheral on APB2 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;                   // Enable clock to GPIO A peripherals on AHB1 bus
   
   // Configure PA5, the GPIO pin with alternative function SCK1
   GPIOA->MODER |= GPIO_MODER_MODER5_1;        // PA5 in Alternative Function mode
   GPIOA->AFR[0] |= 5 << 20;                   // Configure PA5 as alternate function, AF5, SCK1
   
   // Configure PA6, the GPIO pin with alternative function MISO1
   GPIOA->MODER |= GPIO_MODER_MODER6_1;        // PA6 in Alternative Function mode
   GPIOA->AFR[0] |= 5 << 24;                   // Configure PA6 as alternate function, AF5, MISO1
   
   // Configure PA7, the GPIO pin with alternative function MOSI1
   GPIOA->MODER |= GPIO_MODER_MODER7_1;        // PA7 in Alternative Function mode
   GPIOA->AFR[0] |= 5 << 28;                   // Configure PA7 as alternate function, AF5, MOSI1
   
   // Configure PA4, the GPIO pin with function CS
   GPIOA->MODER |= GPIO_MODER_MODER4_0;      // Configure PA4 as output for CS
   
   // Configure PA3, the GPIO pin with function DC
   GPIOA->MODER |= GPIO_MODER_MODER3_0;      // Configure PA3 as output for DC
   
   // Set up SPI1
   SPI1->CR1 = 0;
   SPI1->CR1 |= SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_MSTR;
   SPI1->CR1 |= SPI_CR1_CPOL | SPI_CR1_CPHA;
   SPI1->CR1 |= SPI_CR1_BR_1; // 100MHz divide-by-8 gives 12.5MHz
   SPI1->CR1 |= SPI_CR1_SPE;  // Enable SPI
   
   spi_cs(1);
   spi_dc(1);
}


/* initSPI2 --- set up the SPI2 interface for MCP4822 dual DAC */

static void initSPI2(void)
{
   // Configure Reset and Clock Control
   RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;                    // Enable clock to SPI2 peripheral on APB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;                   // Enable clock to GPIO A peripherals on AHB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;                   // Enable clock to GPIO B peripherals on AHB1 bus
   
   // Configure PB10, the GPIO pin with alternative function SCK2
   GPIOB->MODER |= GPIO_MODER_MODER10_1;       // PB10 in Alternative Function mode
   GPIOB->AFR[1] |= 5 << 8;                    // Configure PB10 as alternate function, AF5, SCK2
   
   // Configure PB14, the GPIO pin with alternative function MISO2
   //GPIOB->MODER |= GPIO_MODER_MODER6_1;        // PB14 in Alternative Function mode
   //GPIOB->AFR[0] |= 5 << 24;                   // Configure PB14 as alternate function, AF5, MISO2
   
   // Configure PB15, the GPIO pin with alternative function MOSI2
   GPIOB->MODER |= GPIO_MODER_MODER15_1;       // PB15 in Alternative Function mode
   GPIOB->AFR[1] |= 5 << 28;                   // Configure PB15 as alternate function, AF5, MOSI2
   
   // Configure PA8, the GPIO pin with function CS
   GPIOA->MODER |= GPIO_MODER_MODER8_0;        // Configure PA8 as output for DAC CS
   
   // Configure Pxx, the GPIO pin with function LDAC
   //GPIOx->MODER |= GPIO_MODER_MODERx_0;      // Configure Pxx as output for LDAC
   
   // Set up SPI2
   SPI2->CR1 = 0;
   SPI2->CR1 |= SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_MSTR;
   SPI2->CR1 |= SPI_CR1_CPOL | SPI_CR1_CPHA;
   SPI2->CR1 |= SPI_CR1_DFF;  // 16-bit mode for just a bit more speed
   SPI2->CR1 |= SPI_CR1_BR_1; // 100MHz divide-by-8 gives 12.5MHz
   SPI2->CR1 |= SPI_CR1_SPE;  // Enable SPI
   
   dac_cs(1);
}


/* initADC --- set up the ADC */

static void initADC(void)
{
   // Configure Reset and Clock Control
   RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;                    // Enable clock to ADC peripheral on APB2 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;                   // Enable clock to GPIO A peripherals on AHB1 bus
   
   // Configure PA1, the GPIO pin with alternative function ADC1
   GPIOA->MODER |= GPIO_MODER_MODER1_1 | GPIO_MODER_MODER1_0;    // PA1 in Analog mode
   
   // Configure PB0, the GPIO pin with alternative function ADC8
   GPIOB->MODER |= GPIO_MODER_MODER0_1 | GPIO_MODER_MODER0_0;    // PB0 in Analog mode
   
   ADC1->CR1 = 0x0;  // Default set-up: 12 bit
   ADC1->CR2 = 0x0;
   ADC1->SMPR1 = 0x0;
   ADC1->SMPR2 = 0x0;
   ADC1->SQR1 = 0x0;
   ADC1->SQR2 = 0x0;
   ADC1->SQR3 = 0x0;
   
   ADC1->CR2 |= ADC_CR2_ADON; // Enable ADC
   
   ADC1->SMPR2 |= 4 << ADC_SMPR2_SMP1_Pos;
   ADC1->SMPR2 |= 4 << ADC_SMPR2_SMP8_Pos;
   
   ADC1->SQR3 |= 0x1;   // Convert just channel 1
}


/* initMillisecondTimer --- set up a timer to interrupt every millisecond */

static void initMillisecondTimer(void)
{
   // Set up timer for regular 1ms interrupt
   if (SysTick_Config(100000)) { // 100MHz divided by 1000  (SystemCoreClock / 1000)
      while (1)
         ;
   }
}


int main(void)
{
   uint32_t end;
   uint32_t frame;
   uint8_t flag = 0;
   const int width = WD + 6;
   int digit = 0;
   int x = digit * width;
   int style = VFD_STYLE;           // Initially draw digits in Vacuum Fluorescent Display style
   uint16_t colour = VFD_COLOUR;    // Initially draw in cyan
   
   initMCU();
   initGPIOs();
   initUARTs();
   initSPI();
   initSPI2();
   initADC();
   initTimers();
   initMillisecondTimer();
   
   __enable_irq();   // Enable all interrupts
   
   OLED_begin(MAXX, MAXY);
   dac_a(0);
   
   greyFrame();
    
   updscreen(0, MAXY - 1);
   
   printf("\nHello from the STM%dF%d\n", 32, 411);
   
   end = millis() + 500u;
   frame = millis() + 40u;
   
   while (1) {
      if (Tick) {
         if (millis() >= end) {
            end = millis() + 500u;
            
            if (flag) {
               GPIOC->BSRR = GPIO_BSRR_BR13; // GPIO pin PC13 LOW, LED on
            }
            else {
               GPIOC->BSRR = GPIO_BSRR_BS13; // GPIO pin PC13 HIGH, LED off
            }
            
            flag = !flag;
            
            printf("millis() = %ld\n", millis());
         }
         
         if (millis() >= frame) {
            frame = millis() + 40u;
            
            const uint16_t ana1 = analogRead(1) / 32;
            const uint16_t ana2 = analogRead(8) / 32;
            fillRect(0, 32, 127, 63, SSD1351_WHITE, SSD1351_BLACK);
            fillRect(1, 33, ana1, 47, SSD1351_BLUE, SSD1351_BLUE);
            fillRect(1, 48, ana2, 62, SSD1351_BLUE, SSD1351_BLUE);
            updscreen(32, 63);
         }
         
         Tick = 0;
      }
      
      if (RtcTick) {
         RtcTick = 0;
      }
      
      if (UART1RxAvailable()) {
         const uint8_t ch = UART1RxByte();
         
         printf("UART1: %02x\n", ch);
         switch (ch) {
         case 'r':
         case 'R':
            setRect(0, 0, MAXX - 1, MAXY - 1, SSD1351_WHITE);
            updscreen(0, MAXY - 1);
            break;
         case 'q':
         case 'Q':
            setVline(MAXX / 4,       0, MAXY - 1, SSD1351_WHITE);
            setVline(MAXX / 2,       0, MAXY - 1, SSD1351_WHITE);
            setVline((MAXX * 3) / 4, 0, MAXY - 1, SSD1351_WHITE);
            setHline(0, MAXX - 1, MAXY / 4, SSD1351_WHITE);
            setHline(0, MAXX - 1, MAXY / 2, SSD1351_WHITE);
            setHline(0, MAXX - 1, (MAXY * 3) / 4, SSD1351_WHITE);
            updscreen(0, MAXY - 1);
            break;
         case 'g':
            digit = 0;
            x = digit * width;
            break;
         case 'h':
            digit = 1;
            x = digit * width;
            break;
         case 'i':
            digit = 2;
            x = digit * width;
            break;
         case 'j':
            digit = 3;
            x = digit * width;
            break;
         case 'k':
            digit = 4;
            x = digit * width;
            break;
         case 'l':
            digit = 5;
            x = digit * width;
            break;
         case '0':
            renderHexDigit(x, 0, style, colour);
            updscreen(0, 31);
            break;
         case '1':
            renderHexDigit(x, 1, style, colour);
            updscreen(0, 31);
            break;
         case '2':
            renderHexDigit(x, 2, style, colour);
            updscreen(0, 31);
            break;
         case '3':
            renderHexDigit(x, 3, style, colour);
            updscreen(0, 31);
            break;
         case '4':
            renderHexDigit(x, 4, style, colour);
            updscreen(0, 31);
            break;
         case '5':
            renderHexDigit(x, 5, style, colour);
            updscreen(0, 31);
            break;
         case '6':
            renderHexDigit(x, 6, style, colour);
            updscreen(0, 31);
            break;
         case '7':
            renderHexDigit(x, 7, style, colour);
            updscreen(0, 31);
            break;
         case '8':
            renderHexDigit(x, 8, style, colour);
            updscreen(0, 31);
            break;
         case '9':
            renderHexDigit(x, 9, style, colour);
            updscreen(0, 31);
            break;
         case 'a':
         case 'A':
            renderHexDigit(x, 0xA, style, colour);
            updscreen(0, 31);
            break;
         case 'b':
         case 'B':
            renderHexDigit(x, 0xB, style, colour);
            updscreen(0, 31);
            break;
         case 'c':
         case 'C':
            renderHexDigit(x, 0xC, style, colour);
            updscreen(0, 31);
            break;
         case 'd':
         case 'D':
            renderHexDigit(x, 0xD, style, colour);
            updscreen(0, 31);
            break;
         case 'e':
         case 'E':
            renderHexDigit(x, 0xE, style, colour);
            updscreen(0, 31);
            break;
         case 'f':
         case 'F':
            renderHexDigit(x, 0xF, style, colour);
            updscreen(0, 31);
            break;
         case '/':
            printf("analogRead = %d, %d\n", analogRead(1), analogRead(8));
            break;
         case '<':
            dac_a(32);  // 0.016V
            break;
         case '=':
            printf("DAC WRITE %d\n", 32 + (12 * 32));
            dac_a(32 + (12 * 32));  // 0.208V
            break;
         case '+':
            dac_a(2000);   // 1.00V because Data Precision 3500's 1V range only goes to 1.2V
            break;
         case '>':
            dac_a(4000);   // 2.00V Fluke 8060A has a 2V range
            break;
         case '.':
            drawSegDP(x, style, colour);
            updscreen(0, 31);
            break;
         case ':':
            drawSegCN(x, style, colour);
            updscreen(0, 31);
            break;
         case 'v':
         case 'V':
            style = VFD_STYLE;
            colour = VFD_COLOUR;
            break;
         case 'w':
         case 'W':
            style = LED_DOT_STYLE;
            colour = LED_COLOUR;
            break;
         case 'x':
         case 'X':
            style = PANAPLEX_STYLE;
            colour = PANAPLEX_COLOUR;
            break;
         case 'y':
         case 'Y':
            style = LED_BAR_STYLE;
            colour = LED_COLOUR;
            break;
         case 'z':
         case 'Z':
            memset(Frame, 0, sizeof (Frame));
            updscreen(0, MAXY - 1);
            break;
         }
      }
   }
}

